# Super users

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

A company defines its super users as those who have made at least two transactions. From the following table, write a query to return, for each user, the date when they become a super user, ordered by oldest super users first. Users who are not super users should also be present in the table.

In [2]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
8 rows affected.
8 rows affected.

# Part A

Write a query that determines the 1st, 2nd, & 3rd, transactions for each user.

In [6]:
%%sql

SELECT 
    *, 
    row_number() 
    OVER (PARTITION by user_id ORDER BY transaction_date ASC) 
    AS transaction_count 
FROM users

 * postgresql://fknight:***@localhost/postgres
8 rows affected.

[(1, 101, datetime.date(2020, 2, 12), 1),
 (1, 111, datetime.date(2020, 2, 14), 2),
 (1, 101, datetime.date(2020, 2, 16), 3),
 (2, 105, datetime.date(2020, 2, 13), 1),
 (2, 105, datetime.date(2020, 2, 17), 2),
 (3, 121, datetime.date(2020, 2, 15), 1),
 (3, 105, datetime.date(2020, 2, 15), 2),
 (4, 101, datetime.date(2020, 2, 16), 1)]

# Part B

As per the question description, users become superusers on their 2nd transaction. Using the subquery from Part A, determine the transaction dates that turned users to superusers.

```sql
WITH transaction_ids AS (
    SELECT 
    *, 
    row_number() 
        OVER (PARTITION by user_id 
              ORDER BY transaction_date ASC) 
        AS transaction_count 
    FROM users
)
```

In [20]:
%%sql

WITH transaction_ids AS (
    SELECT 
    *, 
    row_number() 
        OVER (PARTITION by user_id ORDER BY transaction_date ASC) 
        AS transaction_count 
    FROM users
)

SELECT user_id, transaction_date, transaction_count
FROM transaction_ids
WHERE transaction_count = 2

 * postgresql://fknight:***@localhost/postgres
3 rows affected.

[(1, datetime.date(2020, 2, 14), 2),
 (2, datetime.date(2020, 2, 17), 2),
 (3, datetime.date(2020, 2, 15), 2)]

# Part C

Using the subqueries from Part A & B, solve the original problem.

```sql
WITH transaction_ids AS (
    SELECT 
    *, 
    row_number() 
        OVER (PARTITION by user_id 
              ORDER BY transaction_date ASC) 
        AS transaction_count 
    FROM users
),

transaction_dates AS (
    SELECT user_id, transaction_date 
    FROM transaction_ids
    WHERE transaction_count = 2
)
```

In [18]:
%%sql

WITH transaction_ids AS (
    SELECT 
    *, 
    row_number() 
        OVER (PARTITION by user_id ORDER BY transaction_date ASC) 
        AS transaction_count 
    FROM users
),

transaction_dates AS (
    SELECT user_id, transaction_date 
    FROM transaction_ids
    WHERE transaction_count = 2
)

SELECT 
    DISTINCT users.user_id, 
    transaction_dates.transaction_date AS superuser_date 
FROM users
    LEFT JOIN transaction_dates
    ON users.user_id = transaction_dates.user_id
ORDER BY superuser_date

 * postgresql://fknight:***@localhost/postgres
4 rows affected.

[(1, datetime.date(2020, 2, 14)),
 (3, datetime.date(2020, 2, 15)),
 (2, datetime.date(2020, 2, 17)),
 (4, None)]

## The solution is given below

In [2]:
%%sql

-- create a transaction partitioning by user ID

WITH t1 AS (
    SELECT 
        *, 
        row_number() 
        OVER (PARTITION by user_id ORDER BY transaction_date ASC) 
        AS transaction_number 
    FROM users
),

-- filter resulting table on transaction_number = 2

t2 AS (
    SELECT user_id, transaction_date FROM t1
    WHERE transaction_number = 2 
),

-- left join super users onto full user table, order by date

t3 AS (
    SELECT DISTINCT user_id FROM users 
)

SELECT t3.user_id, transaction_date AS superuser_date FROM t3
LEFT JOIN t2
ON t3.user_id = t2.user_id
ORDER BY 2

 * postgresql://fknight:***@localhost/postgres
4 rows affected.

[(1, datetime.date(2020, 2, 14)),
 (3, datetime.date(2020, 2, 15)),
 (2, datetime.date(2020, 2, 17)),
 (4, None)]